//============================================================================
// Name        : lesson_06_CPP_DM.cpp
// Author      : andry antonenko
// IDE         : Qt Creator 4.14.2 based on Qt 5.15.2
// Description : lesson 06 of the C++: difficult moments course
//============================================================================
#include <QCoreApplication>
#include <iostream>

//----------------------------------------------------------------------------
/*
1. Создайте потокобезопасную оболочку для объекта cout.
Назовите ее pcout. Необходимо,
чтобы несколько потоков могли обращаться к pcout и
информация выводилась в консоль. Продемонстрируйте работу pcout.
//*/


void task_1()
{
  std::cout << "Task 1\n" << std::endl;

  std::cout << std::endl;
}

//----------------------------------------------------------------------------
/*
2. Реализовать функцию, возвращающую i-ое простое число
(например, миллионное простое число равно 15485863).
Вычисления реализовать во вторичном потоке.
В консоли отображать прогресс вычисления.
//*/

void task_2()
{
  std::cout << "\nTask 2\n" << std::endl;

  std::cout << std::endl;
}

//----------------------------------------------------------------------------
/*
3. Промоделировать следующую ситуацию.
Есть два человека (2 потока): хозяин и вор.
Хозяин приносит домой вещи.
При этом у каждой вещи есть своя ценность.
Вор забирает вещи, каждый раз забирает вещь с наибольшей ценностью.
//*/

void task_3()
{
  std::cout << "\nTask 3\n" << std::endl;

  std::cout << std::endl;
}

//----------------------------------------------------------------------------
int main(int argc, char *argv[])
{
  QCoreApplication a(argc, argv);
  //--------------------------------------------------------------------------
  // Task 1
  //*
  task_1();
  //*/
  //--------------------------------------------------------------------------
  // Task 2
  //*
  task_2();
  //*/
  //--------------------------------------------------------------------------
  // Task 3
  //*
  task_3();
  //*/
  //--------------------------------------------------------------------------
  return a.exec();
}
